{
    "lang": {
        "name": "Language",
        "description": "The language for me to use to talk to you.\nIf the server's language is forced, this setting will have no effect on users."
    },
    "override_guild_lang": {
        "name": "Force server language",
        "description": "Force using the language of this server instead of using every single user's language."
    },
    "moderation": {
        "name": "Moderation",
        "description": "Settings for server moderation.",
        "items": {
            "log_channel_id": {
                "name": "Logs channel",
                "description": "The channel where moderation logs will be sent."
            },
            "muted_role_id": {
                "name": "Muted role",
                "description": "The role to give to users to mute."
            },
            "timeout": {
                "name": "Timeout",
                "description": "Whether to use Discord's timeout instead of the mute role."
            }
        }
    },
    "ping_on_reply": {
        "name": "Ping when replying",
        "description": "Pings you when I reply to your messages."
    },
    "yt_news": {
        "name": "YouTube Video notifications",
        "description": "To receive notifications when a new video is uploaded on YouTube.",
        "items": {
            "channel_id": {
                "name": "Channel",
                "description": "The channel where YouTube notifications will be sent."
            },
            "message": {
                "name": "Message",
                "description": "The message to send when a new video is uploaded.",
                "inputs": {
                    "message": "Message"
                }
            }
        }
    },
    "markov": {
        "name": "Text Generation",
        "description": "Settings for the text generator that uses the Markov process.*\n**All messages generated by me are random and only use words previously sent by people.*",
        "items": {
            "enabled": {
                "name": "Enable",
                "description": "Whether to enable message recording and generating.\n\nWhen I record messages, I will only insert into my database the individual words and the number of times they have been used, so I won't save the full messages.\n\nThe data will be used only to generate new messages randomly, and will **NEVER** be sold or used for other purposes.",
                "markov_enabled": "Markov message generation has been enabled and the channel has been automatically set to this one."
            },
            "channel_id": {
                "name": "Channel",
                "description": "The channel from which to record messages and generate new ones.",
                "channel_history_fetch": "Do you want me to fetch the message history of the channel to generate better messages?",
                "cancelled": "I won't fetch the message history, but I will start recording messages from the next one.",
                "learning": "I'm processing the message history of the channel, this may take a very long time depending on the number of messages in this channel.",
                "done": "Done. I will now start recording messages and replying with generated messages. Have fun!"
            },
            "messages": {
                "name": "Messages",
                "description": "Settings for message generation.\n\nYou can set a random interval between a minimum and a maximum of messages (between 2 and 100) to be sent before I generate one.\n\nI can send a message with up to 100 words, but you can also set a smaller number.",
                "inputs": {
                    "min": "Minimum interval of messages",
                    "max": "Maximum interval of messages",
                    "words": "Maximum number of words"
                }
            }
        }
    },
    "markov_add_my_messages": {
        "name": "Use my messages",
        "description": "Whether to add your message to the database for generating new messages."
    }
}