{
    "lang": {
        "name": "Lingua",
        "description": "La lingua che devo usare per parlarti.\nSe la lingua del server viene forzata, questa impostazione non avrà effetto sugli utenti."
    },
    "override_guild_lang": {
        "name": "Forza la lingua del server",
        "description": "Forza l'uso della lingua impostata per questo server invece di usare quella impostata dal singolo utente."
    },
    "moderation": {
        "name": "Moderazione",
        "description": "Impostazioni per la moderazione del server.",
        "items": {
            "log_channel_id": {
                "name": "Canale log",
                "description": "Il canale dove i log verranno inviati."
            },
            "muted_role_id": {
                "name": "Ruolo mutato",
                "description": "Il ruolo da dare agli utenti per mutarli."
            },
            "timeout": {
                "name": "Timeout",
                "description": "Se usare il timeout di Discord invece del ruolo per mutarli."
            }
        }
    },
    "ping_on_reply": {
        "name": "Tag in risposta",
        "description": "Per taggarti quando rispondo ai tuoi messaggi."
    },
    "yt_news": {
        "name": "Notifiche video YouTube",
        "description": "Per ricevere notifiche quando un nuovo video viene caricato su YouTube.",
        "items": {
            "channel_id": {
                "name": "Canale",
                "description": "Il canale dove le notifiche di YouTube saranno inviate."
            },
            "message": {
                "name": "Messaggio",
                "description": "Il messaggio da inviare quando un nuovo video viene caricato.",
                "inputs": {
                    "message": "Messaggio"
                }
            }
        }
    },
    "markov": {
        "name": "Generazione Testo",
        "description": "Impostazioni per il generatore di testo che usa il processo Markov.*\n**Tutti i messaggi generati da me sono casuali ed usano solo parole inviate dalle persone in precedenza.*",
        "items": {
            "enabled": {
                "name": "Abilita",
                "description": "Se attivare la registrazione e generazione di messaggi.\n\nDei messaggi, verranno inserite nel mio database solo le parole e il numero di volte in cui vengono usate, quindi non salverò i messaggi completi.\n\nQuesti dati verranno usati solo ed esclusivamente per generare nuovi messaggi in modo casuale, e non verranno **MAI** venduti o usati per altri scopi.",
                "markov_enabled": "La generazione dei messaggi con Markov è stata attivata ed il canale è stato automaticamente impostato a questo."
            },
            "channel_id": {
                "name": "Canale",
                "description": "Il canale dal quale registrare i messaggi e generarne di nuovi",
                "channel_history_fetch": "Vuoi che io scarichi la cronologia dei messaggi del canale per avere messaggi migliori?",
                "cancelled": "Non scaricherò la cronologia dei messaggi, però comincerò a registrare i messaggi dal prossimo.",
                "learning": "Sto elaborando la cronologia dei messaggi, questo potrebbe richiedere moltissimo tempo in base al numero di messaggi nel canale.",
                "done": "Fatto. Ora comincerò a registrare messaggi e rispondere con messaggi generati. Divertitevi!"
            },
            "messages": {
                "name": "Messaggi",
                "description": "Impostazioni sui messaggi generati da me.\n\nPuoi impostare intervallo casuale tra un minimo e un massimo di messaggi (tra 2 e 100) che verranno inviati prima che io ne generi uno.\n\nPosso mandare un messaggio con massimo 100 parole, ma puoi anche impostare un numero più piccolo.",
                "inputs": {
                    "min": "Intervallo minimo di messaggi",
                    "max": "Intervallo massimo di messaggi",
                    "words": "Numero massimo di parole"
                }
            }
        }
    },
    "markov_add_my_messages": {
        "name": "Usa i miei messaggi",
        "description": "Se includere i tuoi messaggi nella generazione di testo."
    }
}